[
  {
    "project": "Origin",
    "agentName": "Origin Buyback Agent",
    "agentDescription": "AI agent that makes OGV buybacks more impactful. Instead of bi-weekly buybacks, an AI agent could be used to dynamically buy back OGV based on market conditions.",
    "background": "Origin is a multi-purpose DeFi platform that offers staking, NFTs, stablecoins, and other services.",
    "image": "/images/opportunities/origin.png"
  },
  {
    "project": "Shutter",
    "agentName": "Shutter Agent",
    "agentDescription": "Agent to be used for MEV simulations on the Shutter stack that can do things like:\n\n1) Trade on EVM Dexs like Uniswap\n2) Access a mempool to try to perform front-running\n3) Provide liquidity to DEXs like Uniswap\n4) Mint tokens",
    "background": "Shutter is building an encrypted mempool, aimed at securing transaction ordering processes. Their team is interested in theoretical simulations to analyze the economic implications of this technology, alongside various transaction ordering strategies.",
    "image": "/images/opportunities/shutter.png",
    "status": "Completed"
  },
  {
    "project": "Orderly",
    "agentName": "Perp DEX Trader Agent",
    "agentDescription": "Agent that trades on the Orderly perp DEX.",
    "background": "Orderly is an SDK to enables anyone to launch a perp DEX.",
    "image": "/images/opportunities/orderly.png",
    "status": "Completed"
  },
  {
    "project": "Mode",
    "agentName": "Trading Agent Strategies",
    "agentDescription": "Create strategies for AI agents to trade on various Mode DEXs like KIM, Balancer, and Velodrome.",
    "background": "Mode is an Ethereum L2 that is scaling DeFi through onchain agents and AI-powered financial applications.",
    "image": "/images/opportunities/mode.svg"
  },
  {
    "project": "Peaq / Combinder",
    "agentName": "Basic Peaq DePin Agent",
    "agentDescription": "AI Agents that will trade on “energy” in an R&D setting.",
    "background": "Peaq is an L1 blockchain focused on DePin and machine economies.",
    "image": "/images/opportunities/peaq.png",
    "status": "Completed"
  },
  {
    "project": "Azuro",
    "agentName": "Prediction Market Agent",
    "agentDescription": "AI Agent that bets on various Azuro markets including sports betting and prediction markets.",
    "background": "Azuro is the leading provider of tooling, oracle & liquidity solutions for sports betting and other prediction market apps.",
    "image": "/images/opportunities/azuro.png"
  },
  {
    "project": "Alprina",
    "agentName": "Financial Prediction Agent",
    "agentDescription": "Financial product prediction market agent.",
    "background": "Alprina is a prediction market for financial products like stocks, bonds, and other securities that seeks to predict future price movements.",
    "image": "/images/opportunities/alprina.png",
    "date": "05-Sept-24",
    "status": "Completed"
  },
  {
    "project": "IDriss",
    "agentName": "News verification agent",
    "agentDescription": "Trading co-pilot agent that produces actionable advice as you scroll through Twitter / X and other websites. This agent will enable the verification and authenticity of news via a browser extension.",
    "background": "IDriss is a project focused on building open-source tools and consumer apps that make web3 more usable for everyone.",
    "image": "/images/opportunities/idriss.svg"
  },
  {
    "project": "Polymarket",
    "agentName": "Prediction Market Agent",
    "agentDescription": "Agent that trades on Polymarket prediction markets.",
    "background": "Polymarket is a prediction market protocol on Polygon.",
    "image": "/images/opportunities/polymarket.png"
  },
  {
    "project": "Betswirl",
    "agentName": "Arbitrage Agent",
    "agentDescription": "Agent that will arbitrage between Betswirl (Azuro) markets and other marketplaces like Thales.",
    "background": "Betswirl is a GambleFi platform operating on Polygon, BNB Chain, Avalanche, and Arbitrum.",
    "image": "/images/opportunities/betswirl.png"
  },
  {
    "project": "NIM",
    "agentName": "Basic NIM Agent",
    "agentDescription": "Gaming-related AI agent for the NIM ecosystem that can be used to do things like:\n\n1) Enable controlling of NPCs, making them respond intelligently to player actions and evolve their strategies over time.\n2) Enable the creation of evolving in-game narratives and gameplay, adjusting the game's storyline and character interactions in real-time based on player decisions.\n3) Enable procedural content generation, facilitating the creation of vast, diverse, and ever-changing game worlds.\n4) Chat as an influencer with KOLs and other gamers.",
    "background": "NIM is an AI gaming focused blockchain built on Celestia and Dymension.",
    "image": "/images/opportunities/nim.png"
  },
  {
    "project": "OriginTrail",
    "agentName": "Knowledge creator agent",
    "agentDescription": "Knowledge assembly agent into OriginTrails Decentralized Knowledge Graph (DKG) that takes specific topics and becomes an upstream learning and memory system for other agents to leverage.",
    "background": "OriginTrail is a protocol that powers the verifiable internet for AI.",
    "image": "/images/opportunities/origintrail.png"
  },
  {
    "project": "Aizel",
    "agentName": "Offchain Verification Agent",
    "agentDescription": "Agent that runs on the Aizel TEE with onchain verifiable AI models.",
    "image": "/images/opportunities/aizel.png",
    "date": "25-August-24",
    "status": "Completed"
  },
  {
    "project": "Hopscotch",
    "agentName": "Escrow Verification Agent",
    "agentDescription": "Agent that verfies and arbitrates payments.",
    "background": "Hopscotch is an application that fascilitates closing any on-chain deals, including inside active conversations, chats, and other interfaces.",
    "image": "/images/opportunities/hopscotch.jpg",
    "date": "4-September-2024"
  },
  {
    "project": "Rethink",
    "agentName": "DAO Fund Management Agent",
    "agentDescription": "Agent that deploys scalable and trust-minimized strategies for a DAO.",
    "background": "Rethink is committed to transforming the asset management landscape by minimising trust assumptions and eliminating intermediaries.",
    "image": "/images/opportunities/rethink.png",
    "date": "31-December-2024"
  },
  {
    "project": "Sturdy",
    "agentName": "Yield Optimization Agent",
    "agentDescription": "Agent that optimizes yield using the Sturdy Bittensor subnet.",
    "background": "Sturdy enables anyone to create a liquid money market for any token. Sturdy uses a novel two-tier architecture to isolate risk between assets while avoiding liquidity fragmentation.",
    "image": "/images/opportunities/sturdy.jpg",
    "date": "8-October-2024"
  },
  {
    "project": "Irys",
    "agentName": "Irys Integration Component",
    "agentDescription": "Connection component that enables Olas agent developers to access Irys data storage.",
    "background": "Irys is an L1 programmable datachain, designed to optimize data storage and execution.",
    "image": "/images/opportunities/irys.png",
    "date": "25-October-2024"
  },
  {
    "project": "Newcoin",
    "agentName": "Integrate Olas agents into Newcoin",
    "agentDescription": "Integrate existing Olas agents with Newcoin such as the Shorts.wtf agent.",
    "background": "Newcoin is a peer-to-peer AI system and social network powered by creative energy.",
    "image": "/images/opportunities/newcoin.svg",
    "date": "24-October-2024"
  },
  {
    "project": "Masa",
    "agentName": "Masa Integration Component",
    "agentDescription": "Connection component that enables Olas agent developers to access Masa data.",
    "background": "Masa is a decentralized AI network, where people earn by contributing data.",
    "image": "/images/opportunities/masa.svg",
    "date": "29-October-2024"
  },
  {
    "project": "Shutter",
    "agentName": "AI Agent for MEV Simulation on Gnosis Chain",
    "agentDescription": "1) Simulates MEV Scenarios: Develops and tests various MEV (Maximal Extractable Value) strategies.\n2) Transaction Ordering: Simulates and analyses transaction ordering in blockchain environments.\n3) Performance Evaluation: Provides insights on the performance and efficiency of different MEV tactics.\n4) Collaborative Research: Facilitates collaboration with other developers and researchers in the blockchain space.",
    "background": "Shutter is building an encrypted mempool, aimed at securing transaction ordering processes. Their team is interested in theoretical simulations to analyze the economic implications of this technology, alongside various transaction ordering strategies.",
    "image": "/images/opportunities/shutter.png",
    "date": "07-June-24"
  },
  {
    "project": "Trend Moon",
    "agentName": "Trading Agent economy based on insights from social data",
    "agentDescription": "Build an autonomous AI agent economy that monitors, analyzes, and acts on attention trends in the crypto space.",
    "background": "Trend Moon aggregates social data, filters the noise, finds the signal and give you an edge to invest strategically.",
    "image": "/images/opportunities/trendmoon.jpg",
    "date": "20-December-24"
  },
  {
    "project": "Turbo",
    "agentName": "Researcher Agent Economy",
    "agentDescription": "Build an agent economy wherein differnet agents research topics and deposit data artifacts in Induction, a private and personalized AI data layer.",
    "background": "Induction enhances privacy through personalized and on-device data management creating a new data layer for AI.",
    "image": "/images/opportunities/turbo.jpg",
    "date": "20-December-24"
  },
  {
    "project": "Forge",
    "agentName": "Build Agent Mech Tools",
    "agentDescription": "Create new agent skills and abilities that can be sold to other agents on the Olas Mech Marketplace.",
    "background": "Forge is where crypto agents craft their edge—an innovative platform to access, create and request AI tools, all seamlessly powered by the Olas protocol.",
    "image": "/images/opportunities/forge.jpg",
    "date": "16-December-24"
  }
]
